Repository: AhmedShehab1/Raseel_Clinical_System
Catalog: web_flask/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Please log in to access this page.
ar: للوصول الى هذه الصفحة يرجى تسجيل الدخول.

source: Page not found
ar: لم يتم العثور على الصفحة

source: An unexpected error has occured
ar: حدث خطأ غير متوقع

source: Mission
ar: هدفنا

source: We are committed to providing distinguished healthcare services through our distinguished health and administrative staff and advanced medical facilities. In addition to achieving the desire of our customers with full commitment to the ethics of practice in dealing with our patients and continuous improvement and development.
ar: نحن ملتزمون بتقديم خدمات رعاية صحية متميزة من خلال طاقمنا الصحي والإداري المتميز ومرافقنا الطبية المتطورة. بالإضافة إلى تحقيق رغبة عملائنا مع الالتزام التام بأخلاقيات الممارسة في التعامل مع مرضانا والتحسين والتطوير المستمر.

source: Vision
ar: رؤيتنا

source: To be the leading healthcare provider in the region by providing distinguished healthcare services and achieving the highest levels of patient satisfaction.
ar: أن نكون في مقدم الرعاية الصحية الرائد في المنطقة من خلال تقديم خدمات الرعاية الصحية المتميزة وتحقيق أعلى مستويات رضا المرضى.

source: Our Team
ar: فريق العمل

source: Available specialties, names of doctors and their academic degrees
ar: التخصصات المتوفرة وأسماء الأطباء ودرجاتهم العلمية

source: Clinic
ar: العيادة

source: Name and academic certificates
ar: الاسم والشهادات الأكاديمية

source: &copy; 2024 Raseel Medical Care Center
ar: © مركز رسيل للرعاية الطبية 2024

source: Schedule appointment
ar: احجز الآن

source: Complete Intake
ar: استكمال بيانات الإدخال

source: Services
ar: الخدمات

source: Raseel Medical Care Center
ar: مركز رسيل للرعاية الطبية

source: Welcome to Raseel Medical Care Center At Raseel Medical Care Center, we are dedicated to providing exceptional healthcare services tailored to your needs. Our team of experienced medical professionals is committed to ensuring the highest standards of care in a compassionate and welcoming environment. Whether you are visiting for a routine check-up or specialized treatment we are here to support your health journey every step of the way.
ar: مرحباً بك في مركز رسيل للرعاية الطبية في مركز رسيل للرعاية الطبية، نحن ملتزمون بتقديم خدمات رعاية صحية استثنائية مصممة خصيصاً لتلبية احتياجاتك. يلتزم فريقنا من المهنيين الطبيين ذوي الخبرة بضمان توفير أعلى معايير الرعاية في بيئة تتسم بالرحمة والترحاب. سواءً كنت تزورنا لإجراء فحص روتيني أو علاج متخصص، فنحن هنا لدعم رحلتك الصحية في كل خطوة من خطواتها.

source: View Services
ar: عرض الخدمات

source: Quality healthcare
ar: رعاية صحية عالية الجودة

source: Accessible for everyone
ar: متاح للجميع

source: Raseel Medical Care Center in Riyadh delivers comprehensive medical services through a clinical web-based system. We prioritize accessible and quality healthcare, ensuring that every patient receives the care they need. Our dedicated team of professionals is committed to improving health outcomes and enhancing patient satisfaction. Experience healthcare like never before with Raseel Medical Care Center, where your health is our mission.
ar: يقدم مركز رسيل للرعاية الطبية في الرياض خدمات طبية شاملة من خلال نظام طبي قائم على شبكة الإنترنت. نحن نعطي الأولوية للرعاية الصحية التي يسهل الوصول إليها وذات الجودة العالية، مما يضمن حصول كل مريض على الرعاية التي يحتاجها. يلتزم فريقنا المتفاني من المتخصصين بتحسين النتائج الصحية وتعزيز رضا المرضى. اختبر الرعاية الصحية بشكل لم يسبق له مثيل مع مركز رسيل للرعاية الطبية، حيث صحتك هي مهمتنا.

source: Get in touch
ar: راسلنا الآن

source: Our Services
ar: الخدمات

source: Comprehensive medical solutions
ar: حلول طبية شاملة
